/*
Εξετάζοντας την παρακάτω τάξη (class) τι συμπέρασμα/συμπεράσματα 
εξάγετε για την λέξη const για τις μεθόδους της τάξης
*/

class MyClass{
    // Μεταβλητές-μέλη τάξης
    public:
        void Y(const float &k){} // 1
        const char X() {}        // 2
        int W() const {}         // 3
};

// 1
// Το const ορίζει στην συγκεκριμένη περίπτωση την μεταβλητή 
// k ως σταθερή μεταβλητή (constant), δηλαδή δεν γίνεται 
// να αλλάξει η τιμή της μεταβλητής κατά την εκτέλεση.

// 2
// Το const κάνει σταθερή (constant) την μεταβλητή που 
// θα επιστρέψει η συνάρτηση

// 3
// Το const δηλώνει την συνάρτηση W ως σταθερή, αυτό πάει 
// να πει πως η συνάρτηση δεν μπορεί να τροποποιήσει δεδομένα 
// αντικειμένων αλλά μόνο να τα διαβάσει.